//Вывести таблицу умножения для всех чисел от 2 до 9.
//Каждое число необходимо умножить на числа от 1 до 10. 

//--------------//Метод с выведенеием на страницу браузера/---------------------------------------------------------
                  // ((не доделан //
// var i = 1;
// var msg = '';
// while (i < 10) {
//   // msg+= i + ' x 2 = ' + (i * 3) + '<br>';
//   msg+= i + ' x 3 = ' + (i * 3) + '<br>';  
//   i++;
// }
// document.write(msg);

//--------------------//Метод с выводом в консоль/-------------------------------------------------------------------

let sumTab,
    volA,
    volB;

for(volA = 2; volA < 10; volA++){
    for(volB = 1; volB <= 10; volB++)
    {
        sumTab = volA * volB;
        console.log(volA + ' * ' + volB + ' = ' + sumTab);
    }
}